---
kind: method
id: M:Autodesk.Revit.DB.BaseImportOptions.GetDefaultLengthUnit
source: html/df064c95-5e8a-9073-f5c3-6ce74abb0c21.htm
---
# Autodesk.Revit.DB.BaseImportOptions.GetDefaultLengthUnit Method

Get the default length unit used for importing unitless files.

## Syntax (C#)
```csharp
public ForgeTypeId GetDefaultLengthUnit()
```